15) /home/user/Travail/Tests/SudokuGame/src/Kernel.php:37    [M] TrueValue

--- Original
+++ New
@@ @@
     {
         $container->addResource(new FileResource($this->getProjectDir() . '/config/bundles.php'));
         $container->setParameter('container.dumper.inline_class_loader', \PHP_VERSION_ID < 70400 || $this->debug);
-        $container->setParameter('container.dumper.inline_factories', true);
+        $container->setParameter('container.dumper.inline_factories', false);
         $confDir = $this->getProjectDir() . '/config';
         $loader->load($confDir . '/{packages}/*' . self::CONFIG_EXTS, 'glob');
         $loader->load($confDir . '/{packages}/' . $this->environment . '/*' . self::CONFIG_EXTS, 'glob');

16) /home/user/Travail/Tests/SudokuGame/src/Kernel.php:40    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->setParameter('container.dumper.inline_class_loader', \PHP_VERSION_ID < 70400 || $this->debug);
         $container->setParameter('container.dumper.inline_factories', true);
         $confDir = $this->getProjectDir() . '/config';
-        $loader->load($confDir . '/{packages}/*' . self::CONFIG_EXTS, 'glob');
+        
         $loader->load($confDir . '/{packages}/' . $this->environment . '/*' . self::CONFIG_EXTS, 'glob');
         $loader->load($confDir . '/{services}' . self::CONFIG_EXTS, 'glob');
         $loader->load($confDir . '/{services}_' . $this->environment . self::CONFIG_EXTS, 'glob');

17) /home/user/Travail/Tests/SudokuGame/src/Kernel.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->setParameter('container.dumper.inline_factories', true);
         $confDir = $this->getProjectDir() . '/config';
         $loader->load($confDir . '/{packages}/*' . self::CONFIG_EXTS, 'glob');
-        $loader->load($confDir . '/{packages}/' . $this->environment . '/*' . self::CONFIG_EXTS, 'glob');
+        
         $loader->load($confDir . '/{services}' . self::CONFIG_EXTS, 'glob');
         $loader->load($confDir . '/{services}_' . $this->environment . self::CONFIG_EXTS, 'glob');
     }

18) /home/user/Travail/Tests/SudokuGame/src/Kernel.php:42    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $confDir = $this->getProjectDir() . '/config';
         $loader->load($confDir . '/{packages}/*' . self::CONFIG_EXTS, 'glob');
         $loader->load($confDir . '/{packages}/' . $this->environment . '/*' . self::CONFIG_EXTS, 'glob');
-        $loader->load($confDir . '/{services}' . self::CONFIG_EXTS, 'glob');
+        
         $loader->load($confDir . '/{services}_' . $this->environment . self::CONFIG_EXTS, 'glob');
     }
     protected function configureRoutes(RouteCollectionBuilder $routes) : void

19) /home/user/Travail/Tests/SudokuGame/src/Kernel.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $loader->load($confDir . '/{packages}/*' . self::CONFIG_EXTS, 'glob');
         $loader->load($confDir . '/{packages}/' . $this->environment . '/*' . self::CONFIG_EXTS, 'glob');
         $loader->load($confDir . '/{services}' . self::CONFIG_EXTS, 'glob');
-        $loader->load($confDir . '/{services}_' . $this->environment . self::CONFIG_EXTS, 'glob');
+        
     }
     protected function configureRoutes(RouteCollectionBuilder $routes) : void
     {

20) /home/user/Travail/Tests/SudokuGame/src/Kernel.php:46    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
         $loader->load($confDir . '/{services}' . self::CONFIG_EXTS, 'glob');
         $loader->load($confDir . '/{services}_' . $this->environment . self::CONFIG_EXTS, 'glob');
     }
-    protected function configureRoutes(RouteCollectionBuilder $routes) : void
+    private function configureRoutes(RouteCollectionBuilder $routes) : void
     {
         $confDir = $this->getProjectDir() . '/config';
         $routes->import($confDir . '/{routes}/' . $this->environment . '/*' . self::CONFIG_EXTS, '/', 'glob');

21) /home/user/Travail/Tests/SudokuGame/src/Kernel.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function configureRoutes(RouteCollectionBuilder $routes) : void
     {
         $confDir = $this->getProjectDir() . '/config';
-        $routes->import($confDir . '/{routes}/' . $this->environment . '/*' . self::CONFIG_EXTS, '/', 'glob');
+        
         $routes->import($confDir . '/{routes}/*' . self::CONFIG_EXTS, '/', 'glob');
         $routes->import($confDir . '/{routes}' . self::CONFIG_EXTS, '/', 'glob');
     }
 }

22) /home/user/Travail/Tests/SudokuGame/src/Kernel.php:51    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $confDir = $this->getProjectDir() . '/config';
         $routes->import($confDir . '/{routes}/' . $this->environment . '/*' . self::CONFIG_EXTS, '/', 'glob');
-        $routes->import($confDir . '/{routes}/*' . self::CONFIG_EXTS, '/', 'glob');
+        
         $routes->import($confDir . '/{routes}' . self::CONFIG_EXTS, '/', 'glob');
     }
 }

23) /home/user/Travail/Tests/SudokuGame/src/Kernel.php:52    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $confDir = $this->getProjectDir() . '/config';
         $routes->import($confDir . '/{routes}/' . $this->environment . '/*' . self::CONFIG_EXTS, '/', 'glob');
         $routes->import($confDir . '/{routes}/*' . self::CONFIG_EXTS, '/', 'glob');
-        $routes->import($confDir . '/{routes}' . self::CONFIG_EXTS, '/', 'glob');
+        
     }
 }
